In [1]:
import pandas as pd

In [2]:
gender = pd.read_csv("name_gender_dataset.csv")
gender

           Name Gender    Count   Probability
0         James      M  5304407  1.451679e-02
1          John      M  5260831  1.439753e-02
2        Robert      M  4970386  1.360266e-02
3       Michael      M  4579950  1.253414e-02
4       William      M  4226608  1.156713e-02
...         ...    ...      ...           ...
147264   Zylenn      M        1  2.736740e-09
147265   Zymeon      M        1  2.736740e-09
147266   Zyndel      M        1  2.736740e-09
147267   Zyshan      M        1  2.736740e-09
147268    Zyton      M        1  2.736740e-09

[147269 rows x 4 columns]

In [7]:
# Look at the DataFrame shape
gender.shape  ## try to understand why this function is important

(147269, 4)

In [8]:
# 2 head 
gender.head()

      Name Gender    Count  Probability
0    James      M  5304407     0.014517
1     John      M  5260831     0.014398
2   Robert      M  4970386     0.013603
3  Michael      M  4579950     0.012534
4  William      M  4226608     0.011567

In [9]:
# 3 tail 
gender.tail()

          Name Gender  Count   Probability
147264  Zylenn      M      1  2.736740e-09
147265  Zymeon      M      1  2.736740e-09
147266  Zyndel      M      1  2.736740e-09
147267  Zyshan      M      1  2.736740e-09
147268   Zyton      M      1  2.736740e-09

In [10]:
#describe all numerical features
gender.describe()

              Count   Probability
count  1.472690e+05  1.472690e+05
mean   2.481161e+03  6.790295e-06
std    4.645472e+04  1.271345e-04
min    1.000000e+00  2.736740e-09
25%    5.000000e+00  1.368370e-08
50%    1.700000e+01  4.652460e-08
75%    1.320000e+02  3.612500e-07
max    5.304407e+06  1.451679e-02

In [11]:
#describe all categorical features
gender.describe(include = 'object')

          Name  Gender
count   147269  147269
unique  133910       2
top      Dorey       F
freq         2   89749

In [13]:
#mean for all numerical columns
gender.mean()

Count          2481.161344
Probability       0.000007
dtype: float64

In [14]:
#median for all numerical column
gender.median()

Count          1.700000e+01
Probability    4.652460e-08
dtype: float64

In [39]:
#mode for all numerical columns     
gender[['Probability' , 'Count']].mode()

    Probability  Count
0  2.736740e-09      1

In [34]:
#standard deviation for all numerical columns
gender.std()

Count          46454.717975
Probability        0.000127
dtype: float64

In [37]:
#sum for all numerical columns
gender[['Probability' , 'Count']].sum()

Probability            1.0
Count          365398150.0
dtype: float64

In [40]:
#count for all columns
gender.count()

Name           147269
Gender         147269
Count          147269
Probability    147269
dtype: int64

In [47]:
#How many missing values are in each column 
gender.isna().sum()

Name           0
Gender         0
Count          0
Probability    0
dtype: int64

In [49]:
#value_counts for all categorical columns
gender[['Name' , 'Gender']].value_counts()

Name      Gender
Zzyzx     M         1
Guneet    F         1
Gunil     M         1
Guni      F         1
Gunhild   F         1
                   ..
Nashiyah  F         1
Nashla    F         1
Nashley   F         1
          M         1
A         F         1
Length: 147269, dtype: int64

In [54]:
#Subset your DataFrame based on one condition
female_gender = gender[gender['Gender'] == 'F']
female_gender

             Name Gender    Count   Probability
5            Mary      F  4169663  1.141129e-02
14      Elizabeth      F  1704140  4.663789e-03
15       Patricia      F  1608260  4.401391e-03
16       Jennifer      F  1584426  4.336163e-03
19          Linda      F  1480592  4.051996e-03
...           ...    ...      ...           ...
133945      Zyika      F        1  2.736740e-09
133946   Zymeliah      F        1  2.736740e-09
133947     Zyrije      F        1  2.736740e-09
133948    Zyrinah      F        1  2.736740e-09
133949       Zyta      F        1  2.736740e-09

[89749 rows x 4 columns]

In [58]:
#Subset your DataFrame based on two different conditions
two_cond_ge = gender[(gender['Gender']== 'F')& (gender['Count'] > 100)] 
two_cond_ge

            Name Gender    Count   Probability
5           Mary      F  4169663  1.141129e-02
14     Elizabeth      F  1704140  4.663789e-03
15      Patricia      F  1608260  4.401391e-03
16      Jennifer      F  1584426  4.336163e-03
19         Linda      F  1480592  4.051996e-03
...          ...    ...      ...           ...
41111  Yeraldine      F      101  2.764110e-07
41112      Yesha      F      101  2.764110e-07
41113    Zanaiya      F      101  2.764110e-07
41114     Zenola      F      101  2.764110e-07
41115     Zhanna      F      101  2.764110e-07

[25288 rows x 4 columns]

In [65]:
#Subset your DataFrame based on three different conditions
three_cond_ge = gender[(gender['Gender']== 'F')& (gender['Count'] > 100) &(gender['Name'] == 'Mary')] 
three_cond_ge

   Name Gender    Count  Probability
5  Mary      F  4169663     0.011411

In [79]:
#Use loc to slice your DataFrame for the 2 columns that returned the largest sum
gender.loc[: , ['Probability','Count']].sum()

Probability            1.0
Count          365398150.0
dtype: float64

In [82]:
# Use iloc to slice your DataFrame for the 2 columns that returned the largest mean
gender.iloc[: , [2,3]].mean()

Count          2481.161344
Probability       0.000007
dtype: float64

In [84]:
#Find 2 pandas DataFrame methods we did not cover and use them on your own data
#Explain what they do by writing a description in the markdown
gender.duplicated()   # explain there any repeat value ?

0         False
1         False
2         False
3         False
4         False
          ...
147264    False
147265    False
147266    False
147267    False
147268    False
Length: 147269, dtype: bool

In [86]:
gender['Name'].unique() # show all value we have without any repeat

array(['James', 'John', 'Robert', ..., 'Zyndel', 'Zyshan', 'Zyton'],
      dtype=object)

In [ ]:
# thank you for read my assignment